# language: ru
Функция: Регистрация заявки на брак
  Как пользователь приложения ЗАГС
  Я хочу оформить заявку на регистрацию брака

  @wedding
  Сценарий: Успешная подача одной заявки на регистрацию брака
    Дано пользователь авторизуется как "пользователь"
    И пользователь заполняет форму заявителя случайными данными для заявки регистрации брака
    И пользователь нажимает кнопку "Далее"
    И пользователь выбирает услугу "Регистрация брака"
    И пользователь заполняет форму гражданина случайными данными для заявки регистрации брака
    И пользователь нажимает кнопку "Далее"
    И пользователь заполняет форму брака случайными данными
    И пользователь нажимает кнопку "Завершить"
    Тогда отображается текст "Спасибо за обращение!"
    И статус заявки равен "Статус заявки: На рассмотрении."
    И отображается дата регистрации заявки